Extensions/BankOperationsUpload/Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Расход</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОперацияПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОписаниеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КошелекДолг</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФинансоваяЦельОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеРасходаПоЧеку</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРасходаПоЧеку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>QRКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_ЗагруженИзНалоговой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_НоменклатураОбработана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_РасходыЗаполненыПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>money_Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>money_Номенклатура</Name>
					<Comment>https://github.com/Denis-Shaymardanov/Money/issues/4</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.money_НоменклатураПоставщиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.money_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФинансоваяЦель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходаИмущество</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкидкаВведенаВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КомментарийСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/BankOperationsUpload/Catalogs/Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контакты</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОфициальноеНазвание</Name>
					<Comment>https://github.com/Denis-Shaymardanov/Money/issues/4</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВебАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДеньРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НапоминатьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/BankOperationsUpload/Documents/Расход/Ext/ObjectModule.bsl
Функция ЗагрузитьДанныеЧекаИзНалоговой() Экспорт
		
	ПараметрыПолученияЧека = ПолучитьПараметрыПолученияЧека();
	ДанныеЧекаИзНалоговой = ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека); 
	
	Если НЕ ЗначениеЗаполнено(ДанныеЧекаИзНалоговой) Тогда
		Возврат Ложь;
	КонецЕсли;	                
	
	ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧекаИзНалоговой);
	
	//Если все ОК - установим признак, что чек загружен, а также запишем документ
	Если money_Номенклатура.Количество() > 0 Тогда
		ЭтотОбъект.money_ЗагруженИзНалоговой = Истина;
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли; 
	
	Возврат Истина;
		
КонецФункции 

Функция ПолучитьОписаниеШапкиЧека()
	
    ШапкаЧека = Новый Структура("Магазин");
	
	Возврат ШапкаЧека;
	
КонецФункции

Функция ПолучитьОписаниеТаблицыТоваров()
	
	Возврат ЭтотОбъект.money_Номенклатура.Выгрузить().СкопироватьКолонки();
	
КонецФункции

Функция ПолучитьПараметрыПолученияЧека()
	
	ПараметрыПолученияЧека = money_РаботаССерверомPython.ПолучитьПараметрыПодключенияКСерверу();
	ПараметрыПолученияЧека.Вставить("Метод", ?(money_Отладка, "debug", "check")); 
	ПараметрыПолученияЧека.Вставить("Параметры", Новый Структура("token, qrraw", Константы.ТокенПроверкаЧеков.Получить(), ЭтотОбъект.QRКод));	
	ПараметрыПолученияЧека.Вставить("ОписаниеШапкиЧека", ПолучитьОписаниеШапкиЧека());
	ПараметрыПолученияЧека.Вставить("ОписаниеТаблицыТоваров", ПолучитьОписаниеТаблицыТоваров());
	
	Возврат ПараметрыПолученияЧека;
	
КонецФункции

Функция ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека)
		
	ОтветИзНалоговой = ЗапросВНалоговую(ПараметрыПолученияЧека);  
	
	Если НЕ ЗначениеЗаполнено(ОтветИзНалоговой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЧека = ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека);
	
	Возврат ДанныеЧека;
	
КонецФункции  

Функция ЗапросВНалоговую(ПараметрыПолученияЧека) 
	
	Ответ = money_РаботаССерверомPython.ЗапросКСерверу(ПараметрыПолученияЧека);
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если money_Отладка Тогда
		ОбщегоНазначения.СообщитьПользователю(Ответ);
		Возврат Неопределено;		
	КонецЕсли;
	
    Возврат Ответ;
	
КонецФункции

Функция ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека)
	
	ДанныеЧека = Новый Структура("ШапкаЧека, ТаблицаТоваров", 
									ПараметрыПолученияЧека.ОписаниеШапкиЧека, ПараметрыПолученияЧека.ОписаниеТаблицыТоваров); 
	
	Попытка
		СтруктураДанныеЧека = ПрочитатьЗначениеJSON(ОтветИзНалоговой);		
	Исключение
		Возврат ДанныеЧека;		
	КонецПопытки; 
	
	Если СтруктураДанныеЧека.Свойство("detail") Тогда
		ТекстСообщения = "Ошибка получения данных чека";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);  
		Возврат ДанныеЧека;
	КонецЕсли;
	
	Магазин = НайтиСоздатьМагазин(СтруктураДанныеЧека.shop.legal_name);
	
	ДанныеЧека.ШапкаЧека.Магазин = Магазин;
	
	Для Каждого Стр Из СтруктураДанныеЧека.items Цикл
		НоваяСтрока = ДанныеЧека.ТаблицаТоваров.Добавить();
		НоваяСтрока.НоменклатураПоставщика = НайтиСоздатьНоменклатуруПоставщика(Магазин, Стр.name);
		НоваяСтрока.Номенклатура 	= НоваяСтрока.НоменклатураПоставщика.Номенклатура;
		НоваяСтрока.СтатьяРасходов 	= НоваяСтрока.Номенклатура.СтатьяРасходов;
		НоваяСтрока.Количество 		= Стр.quantity;
		НоваяСтрока.Цена 			= Стр.price;    
		НоваяСтрока.Сумма			= Стр.sum;
		
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		НоваяСтрока.СтатьяРасходов	= НоваяСтрока.Номенклатура.СтатьяРасходов;		
	КонецЦикла;
		
	Возврат ДанныеЧека;	
	
КонецФункции     

Функция НайтиСоздатьМагазин(ОфициальноеНазвание)
	
	ОфициальноеНазвание = СокрЛП(ОфициальноеНазвание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контакты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контакты КАК Контакты
	|ГДЕ
	|	НЕ Контакты.ПометкаУдаления
	|	И НЕ Контакты.ЭтоГруппа
	|	И Контакты.ОфициальноеНазвание = &ОфициальноеНазвание"; 
	
	Запрос.УстановитьПараметр("ОфициальноеНазвание", ОфициальноеНазвание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НовыйКонтакт = Справочники.Контакты.СоздатьЭлемент();
	НовыйКонтакт.ОфициальноеНазвание = ОфициальноеНазвание;
	НовыйКонтакт.Наименование = ОфициальноеНазвание;
	НовыйКонтакт.Активность = Истина;
	НовыйКонтакт.ОбменДанными.Загрузка = Истина;
	
	НовыйКонтакт.Записать();
	
	Возврат НовыйКонтакт.Ссылка;
	
КонецФункции

Функция НайтиСоздатьНоменклатуруПоставщика(Магазин, Наименование)
	
	Наименование = СокрЛП(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.money_НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Поставщик = &Магазин"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НоваяНоменклатураПоставщика = Справочники.money_НоменклатураПоставщиков.СоздатьЭлемент();
	НоваяНоменклатураПоставщика.Поставщик = Магазин;
	НоваяНоменклатураПоставщика.Наименование = Наименование;
	НоваяНоменклатураПоставщика.ОбменДанными.Загрузка = Истина;
	
	НоваяНоменклатураПоставщика.Записать();
	
	Возврат НоваяНоменклатураПоставщика.Ссылка;
	
КонецФункции

Процедура ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧека)  
	
	//Заполним магазин в шапке документа
	Аналитика = ЭтотОбъект.АналитикаДокумента.Добавить();                       
	Аналитика.ВидАналитики = ПланыВидовХарактеристик.ВидыАналитик.МестоТраты;
	Аналитика.РедактироватьВШапке = Истина;
	Аналитика.ЗначениеАналитикиВШапке = ДанныеЧека.ШапкаЧека.Магазин;
	
	//Заполним номенклатуру
	
	Для Каждого Стр Из ДанныеЧека.ТаблицаТоваров Цикл
		НоваяСтрока = ЭтотОбъект.money_Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура УчетТоваров_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;		
	КонецЕсли;
	
	Если money_РасходыЗаполненыПоНоменклатуре Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ money_НоменклатураОбработана Тогда
		Возврат;
	КонецЕсли;  
	
	Если money_Номенклатура.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	Если Расходы.Итог("Сумма") <> money_Номенклатура.Итог("Сумма") - СуммаСкидки Тогда
		Отказ = Истина; 
		ТекстСообщения = "Расходятся суммы в табличных частях. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Расходы.Очистить();

	ТаблицаПоСтатьямРасходов = money_Номенклатура.Выгрузить();
	ТаблицаПоСтатьямРасходов.Свернуть("СтатьяРасходов", "Сумма");
	
	Расходы.Очистить();	
	
	Для Каждого Стр Из ТаблицаПоСтатьямРасходов Цикл
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.СтатьяРасходаИмущество = Стр.СтатьяРасходов; 
		НоваяСтрока.Сумма = Стр.Сумма;
	КонецЦикла;  
	
	money_РасходыЗаполненыПоНоменклатуре = Истина;
	
КонецПроцедуры
